#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform plan:

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_codeconnections_connection.demo-githubconnection will be created
  + resource "aws_codeconnections_connection" "demo-githubconnection" {
      + arn               = (known after apply)
      + connection_status = (known after apply)
      + id                = (known after apply)
      + name              = "demo-github-connection"
      + owner_account_id  = (known after apply)
      + provider_type     = "GitHub"
      + region            = "ap-southeast-1"
      + tags_all          = {
          + "Environment" = "dev"
          + "Modules"     = "true"
          + "Name"        = "demo-codeconnections-tf"
          + "Purpose"     = "Demo CodeConnections by Terraform CI/CD"
          + "Terraform"   = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>
*Pushed by: @troynguyeen, Action: `pull_request`*